run/CleanCases/Kazuhide_c4_k-e_2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 296;

boundaryField
{
  inlet
  {
      type            fixedValue;
      value           $internalField;
  }
  source2
  {
      type            fixedValue;
      value           $internalField;
  }
  source3
  {
      type            fixedValue;
      value           $internalField;
  }
  outlet
  {
      type            inletOutlet;
      inletValue      $internalField;
      value           $internalField;
  }
  leftAndRight
  {
      type            fixedValue;
      value           $internalField;
  }
  topAndBottom
  {
      type            fixedValue;
      value           $internalField;
  }
  frontAndBack
  {
      type            empty;
  }
}


// ************************************************************************* //
