run/CleanCases/Kazuhide_c4_k-e_2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.54;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00527333;
    }
    source2
    {
        type            fixedValue;
        value           uniform 3.54;
    }
    source3
    {
        type            fixedValue;
        value           uniform 3.54;
    }
    outlet
    {
        type            zeroGradient;
    }
    leftAndRight
    {
      type            epsilonWallFunction;
      value           uniform 3.54;
    }
    topAndBottom
    {
      type            epsilonWallFunction;
      value           uniform 3.54;
    }
    frontAndBack
    {
        type            empty;
    }
}
