run/CleanCases/Kazuhide_c4_k-e_2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00307; //3/2*(U*0.015)^2

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    source2
    {
        type            zeroGradient;
    }
    source3
    {
        type            zeroGradient;
    }
    outlet
    {
      type            zeroGradient;
    }
    leftAndRight
    {
      type            zeroGradient;
    }
    topAndBottom
    {
      type            zeroGradient;
    }
    frontAndBack
    {
      type            empty;
    }
}

// ************************************************************************* //
