run/CleanCases/Kazuhide_c4_k-e_2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
  inlet
  {
      type            calculated;
      value           uniform 0;
  }
  source2
  {
      type            calculated;
      value           uniform 0;
  }
  source3
  {
      type            calculated;
      value           uniform 0;
  }
  outlet
  {
      type            calculated;
      value           uniform 0;
  }
  leftAndRight
  {
      type            nutkWallFunction;
      value           uniform 0;
  }
  topAndBottom
  {
      type            nutkWallFunction;
      value           uniform 0;
  }
  frontAndBack
  {
      type            empty;
  }
}

// ************************************************************************* //
