run/CleanCases/Kazuhide_c4_k-e_2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    source2
    {
        type            zeroGradient;
    }
    source3
    {
        type            zeroGradient;
    }
    outlet
    {
        //type            fixedValue;
        //value           uniform 2860;
        type            zeroGradient;
    }
    topAndBottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    leftAndRight
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
