run/CleanCases/Kazuhide_c4_k-e_2D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
      type               fixedFluxPressure;
      value              $internalField;
    }
    source2
    {
      type               fixedFluxPressure;
      value              $internalField;
    }
    source3
    {
      type               fixedFluxPressure;
      value              $internalField;
    }
    outlet
    {
      type               prghPressure;
      p                  $internalField;
      value              $internalField;
      // type               totalPressure;
      // p                  $internalField;
      // p0                  $internalField;
      // value              $internalField;
    }
    leftAndRight
    {
      type               fixedFluxPressure;
      value              $internalField;
    }
    topAndBottom
    {
      type               fixedFluxPressure;
      value              $internalField;
    }
    frontAndBack
    {
      type               empty;
    }
}


// ************************************************************************* //
