run/CleanCases/Kazuhide_c4_k-e_2D/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:
    Bui-Pham, M. N. (1992).
    Studies in structures of lam inar hydrocarbon flames.
    PhD Thesis, University of California, San Diego

Notes:
    This mechanism was developed for simulating this exact counter-flow flame
    configuration. It should not be considered general-purpose.

\*---------------------------------------------------------------------------*/

reactions
{
    limoneneReaction
    {
        type     irreversibleArrhenius;
        reaction "C10H16 + O3 = 2Cprod1";
        A        1.753e6;//2.91e-15; Conversion from cm3 molec-1 s-1 to m3 kmol-1 s-1
        beta     0;
        Ta       770;
    }
}

// ************************************************************************* //
