run/CleanCases/Kazuhide_c4_k-e_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.75 0.15 0)//0
    (-0.37 0.15 0)//1
    (-0.37 -0.15 0)//2
    (-0.75 -0.15 0)//3
    (-0.75 0.15 0.98)//4
    (-0.37 0.15 0.98)//5
    (-0.37 -0.15 0.98)//6
    (-0.75 -0.15 0.98)//7
    (-0.35 0.15 0)//8
    (-0.35 -0.15 0)//9
    (-0.35 0.15 0.98)//10
    (-0.35 -0.15 0.98)//11

    (0.75 0.15 0)//12
    (0.37 0.15 0)//13
    (0.37 -0.15 0)//14
    (0.75 -0.15 0)//15
    (0.75 0.15 0.98)//16
    (0.37 0.15 0.98)//17
    (0.37 -0.15 0.98)//18
    (0.75 -0.15 0.98)//19
    (0.35 0.15 0)//20
    (0.35 -0.15 0)//21
    (0.35 0.15 0.98)//22
    (0.35 -0.15 0.98)//23

    (-0.75 0.15 1)//24
    (0.75 0.15 1)//25
    (0.75 -0.15 1)//26
    (-0.75 -0.15 1)//27
);

blocks
(
    // hex (3 2 1 0 7 6 5 4) (38 30 196) simpleGrading (1 1 1)
    // hex (2 9 8 1 6 11 10 5) (2 30 196) simpleGrading (1 1 1)
    // hex (9 21 20 8 11 23 22 10) (70 30 196) simpleGrading (1 1 1)
    // hex (21 14 13 20 23 18 17 22) (2 30 196) simpleGrading (1 1 1)
    // hex (14 15 12 13 18 19 16 17) (38 30 196) simpleGrading (1 1 1)
    // hex (7 19 16 4 27 26 25 24) (150 30 5) simpleGrading (1 1 1)
    hex (3 2 1 0 7 6 5 4) (38 1 98) simpleGrading (1 1 1)
    hex (2 9 8 1 6 11 10 5) (2 1 98) simpleGrading (1 1 1)
    hex (9 21 20 8 11 23 22 10) (70 1 98) simpleGrading (1 1 1)
    hex (21 14 13 20 23 18 17 22) (2 1 98) simpleGrading (1 1 1)
    hex (14 15 12 13 18 19 16 17) (38 1 98) simpleGrading (1 1 1)
    hex (7 19 16 4 27 26 25 24) (150 1 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 4 24 27)
        );
    }
    source2
    {
        type patch;
        faces
        (
            (21 14 13 20)
        );
    }
    source3
    {
        type patch;
        faces
        (
            (2 9 8 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 26 25 16)
        );
    }
    frontAndBack//frontBackTopBottomLeftRight
    {
        type empty;
        faces
        (
            (21 23 18 14)
            (14 18 19 15)
            (9 11 23 21)
            (2 6 11 9)
            (7 27 26 19)
            (2 6 7 3)
            (12 16 17 13)
            (13 17 22 20)
            (20 22 10 8)
            (8 10 5 1)
            (1 5 4 0)
            (16 25 24 4)
        );
    }
    leftAndRight//frontBackTopBottomLeftRight
    {
        type wall;
        faces
        (
            (3 7 4 0)
            (15 19 16 12)
        );
    }
    topAndBottom//frontBackTopBottomLeftRight
    {
        type wall;
        faces
        (
            (27 26 25 24)
            (15 14 13 12)
            //(14 21 20 13) source in @ bottom
            (21 9 8 20)
            //(9 2 1 8)
            (2 3 0 1)

        );
    }
    interface1
    {
        type wall;
        faces
        (
            (7 19 16 4)
        );
    }
    interface2
    {
        type wall;
        faces
        (
            (7 6 5 4)
            (6 11 10 5)
            (11 23 22 10)
            (23 18 17 22)
            (18 19 16 17)
        );
    }
);

mergePatchPairs
(
    (interface1 interface2)
);

// ************************************************************************* //
