run/CleanCases/Kazuhide_c4_k-e_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingBuoyantFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         7200;

deltaT          2;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      4320;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxDeltaT       4;
maxCo           1;
maxAlphaCo      1;

functions
{
    #includeFunc Qdot
}


// ************************************************************************* //
