run/CleanCases/Kazuhide_c4_k-e_2D/system/machines
zeus
hephaestus cpu=2
